In [1]:
#Creating a car price series with a dictionary
import pandas as pd
car_price_dict = {'Swift':  700000,
                       'Jazz' :  800000,
                       'Civic' : 1600000,
                       'Altis' : 1800000,
                       'Gallardo': 30000000
                      }
car_price = pd.Series(car_price_dict)
# Creating the car manufacturer series with a dictionary
car_man_dict = {'Swift' : 'Maruti',
                  'Jazz'   : 'Honda',
                  'Civic'  : 'Honda',
                  'Altis'  : 'Toyota',
                   'Gallardo' : 'Lamborghini'}
car_man = pd.Series(car_man_dict)
print(car_price)
print(car_man)

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
dtype: int64
Swift            Maruti
Jazz              Honda
Civic             Honda
Altis            Toyota
Gallardo    Lamborghini
dtype: object

In [8]:
cars_df = pd.DataFrame({'Price' : car_price, 'Manufacturer' : car_man_dict})

             Price Manufacturer
Swift       700000       Maruti
Jazz        800000        Honda
Civic      1600000        Honda
Altis      1800000       Toyota
Gallardo  30000000  Lamborghini

In [8]:
#Details about the dataset
cars_df.describe()

              Price
count  5.000000e+00
mean   6.980000e+06
std    1.287758e+07
min    7.000000e+05
25%    8.000000e+05
50%    1.600000e+06
75%    1.800000e+06
max    3.000000e+07

In [9]:
#Deriving Top3 customers using SQL and Pandas
import sqlite3 as sl
conn = sl.connect(':memory:')
cars_df.to_sql('Cars',conn, if_exists = 'replace')

query = """

select * from Cars order by Price desc 
"""

costly_cars = pd.read_sql(query, con =conn)

costly_cars[1:4]

   index    Price Manufacturer
1  Altis  1800000       Toyota
2  Civic  1600000        Honda
3   Jazz   800000        Honda

In [4]:
#Checking for Null values
cars_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Swift to Gallardo
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Price         5 non-null      int64
 1   Manufacturer  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

In [15]:
#Filtering Honda manufacturer
cars_df.loc[cars_df['Manufacturer'] == 'Honda']

         Price Manufacturer
Jazz    800000        Honda
Civic  1600000        Honda

In [21]:
#Manufacturer minimum and maximum price
Manuf_price = cars_df.groupby('Manufacturer')['Price'].aggregate( ['min','max'])
Manuf_price

                   min       max
Manufacturer
Honda           800000   1600000
Lamborghini   30000000  30000000
Maruti          700000    700000
Toyota         1800000   1800000

In [32]:
Indexing = cars_df.reset_index()
Indexing

      index     Price Manufacturer
0     Swift    700000       Maruti
1      Jazz    800000        Honda
2     Civic   1600000        Honda
3     Altis   1800000       Toyota
4  Gallardo  30000000  Lamborghini